InformationRegisters/ПодпискаНаИТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПодпискаНаИТС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Платная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КонтрагентПП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтрагентыПП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ПодпискаНаИТС/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьОкончаниеПодписки()
	ОкончаниеПодписки = ДобавитьМесяц( НачалоПодписки, Количество - 1);
КонецПроцедуры


&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	УстановитьОкончаниеПодписки();
КонецПроцедуры

&НаКлиенте
Процедура НачалоПодпискиПриИзменении(Элемент)
	НачалоПодписки = НачалоМесяца( НачалоПодписки );
	УстановитьОкончаниеПодписки();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНачалоСледующейПодписки( ПрограммныйПродукт )
	сПодписка = Новый Структура;
	сПодписка.Вставить("НачалоПодписки", 	НачалоМесяца( ДобавитьМесяц( ТекущаяДата(), 1)));
	// по умолчанию
	сПодписка.Вставить("ИТС", 				Справочники.Номенклатура.НайтиПоНаименованию("ИТС. БюджетПРОФ 3 месяцев",Истина));
	сПодписка.Вставить("Количество", 		1);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодпискаНаИТССрезПоследних.Период,
		|	ПодпискаНаИТССрезПоследних.ИТС,
		|	ПодпискаНаИТССрезПоследних.Количество
		|ИЗ
		|	РегистрСведений.ПодпискаНаИТС.СрезПоследних(, КонтрагентПП = &ПрограммныйПродукт) КАК ПодпискаНаИТССрезПоследних";
	
	Запрос.УстановитьПараметр("ПрограммныйПродукт", ПрограммныйПродукт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		сПодписка.Вставить("НачалоПодписки", 	ДобавитьМесяц( ВыборкаДетальныеЗаписи.Период, 1));
		сПодписка.Вставить("ИТС", 				ВыборкаДетальныеЗаписи.ИТС);
		сПодписка.Вставить("Количество", 		ВыборкаДетальныеЗаписи.Количество);
	КонецЦикла;
	Возврат сПодписка;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Контрагент 			= Параметры.Контрагент;
	ПрограммныйПродукт 	= Параметры.ПрограммныйПродукт;
	сПодписка 			= ПолучитьНачалоСледующейПодписки(ПрограммныйПродукт); 
	НачалоПодписки		= сПодписка.НачалоПодписки;
	Количество			= сПодписка.Количество;
	ИТС					= сПодписка.ИТС;
	Платная				= ?(Параметры.Свойство("Платная"), Параметры.Платная, Истина );
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	с=4;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	с=4;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодписатьНаСервере( Парам )
	МенЗаписи = РегистрыСведений.ПодпискаНаИТС.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств( МенЗаписи, Парам );
	Попытка
		МенЗаписи.Записать();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось оформить подписку на ИТС" +
							ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодпискаРазрешена( Парам );
	
	Если НЕ ЗначениеЗаполнено( Парам.КонтрагентПП ) Тогда
		Возврат "Не указан ПП контрагента";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено( Парам.ИТС ) Тогда
		Возврат "Не указан вид ИТС";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено( Парам.Количество ) Тогда
		Возврат "Не указано количество месяцев подписки";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено( Парам.Период ) Тогда
		Возврат "Не указан срок окончания подписки";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПодпискаНаИТССрезПервых.Период
		|ИЗ
		|	РегистрСведений.ПодпискаНаИТС.СрезПервых(&НачалоПодписки, КонтрагентПП = &КонтрагентПП) КАК ПодпискаНаИТССрезПервых";
	
	Запрос.УстановитьПараметр("КонтрагентПП", 		Парам.КонтрагентПП);
	Запрос.УстановитьПараметр("НачалоПодписки", 	Парам.НачалоПодписки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Текст = "На ПП " + Парам.КонтрагентПП + "( Рег № " + Парам.КонтрагентПП.Код +")" + Символы.ПС +
				"подписка оформлена по " + Формат(ВыборкаДетальныеЗаписи.Период,"ДЛФ=DD" ) ;
		Возврат Текст;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции


&НаКлиенте
Процедура Подписать(Команда)
	// проверка заполнения
	сПарам = Новый Структура;
	сПарам.Вставить("Период", 				ОкончаниеПодписки);
	сПарам.Вставить("КонтрагентПП", 		ПрограммныйПродукт );
	сПарам.Вставить("ИТС", 					ИТС);
	сПарам.Вставить("Платная", 				Платная);
	сПарам.Вставить("Количество", 			Количество);
	сПарам.Вставить("НачалоПодписки", 		НачалоПодписки);
	
	ТекстЗапрещения = ПодпискаРазрешена( сПарам );
	Если НЕ ЗначениеЗаполнено( ТекстЗапрещения ) Тогда
		ПодписатьНаСервере( сПарам );
		Закрыть();
	Иначе
		ПоказатьПредупреждение(,ТекстЗапрещения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОкончаниеПодписки();
КонецПроцедуры
